---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.DocumentSavingEventArgs
source: html/1a995d7d-c3bd-3441-8fe8-a37d2b08e496.htm
---
# DocumentSavingEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.